import pandas as pd

save_path = './Energy/11_submission/'

train_all = pd.read_csv(save_path + 'nn_train.csv')
test_all = pd.read_csv(save_path + 'nn_test.csv')

print(train_all.columns)
print(test_all.columns)

# Index(['건물번호', '일시', '기온(°C)', '강수량(mm)', '풍속(m/s)', '습도(%)', '일조(hr)',
#        '일사(MJ/m2)', '전력소비량(kWh)', '건물유형', '연면적(m2)', '냉방면적(m2)', '태양광용량(kW)',
#        'ESS저장용량(kWh)', 'PCS용량(kW)', '시각', '요일', '월', '일', '주말여부', '근무시간',
#        'SIN_시', 'COS_시', 'SIN_월', 'COS_월', 'SIN_일', 'COS_일', '요일_0', '요일_1',
#        '요일_2', '요일_3', '요일_4', '요일_5', '요일_6', 'IDC(전화국)', '건물기타', '공공', '백화점',
#        '병원', '상용', '아파트', '연구소', '학교', '호텔', '불쾌지수', '태양광per냉방면적', 'ESS설치여부',
#        'PCS설치여부', '설비밀도', '기온X습도', '강수유무'],
#       dtype='object')
# Index(['건물번호', '일시', '기온(°C)', '강수량(mm)', '풍속(m/s)', '습도(%)', '건물유형',
#        '연면적(m2)', '냉방면적(m2)', '태양광용량(kW)', 'ESS저장용량(kWh)', 'PCS용량(kW)', '시각',
#        '요일', '월', '일', '주말여부', '근무시간', 'SIN_시', 'COS_시', 'SIN_월', 'COS_월',
#        'SIN_일', 'COS_일', '요일_0', '요일_1', '요일_2', '요일_3', '요일_4', '요일_5',
#        '요일_6', 'IDC(전화국)', '건물기타', '공공', '백화점', '병원', '상용', '아파트', '연구소', '학교',
#        '호텔', '불쾌지수', '태양광per냉방면적', 'ESS설치여부', 'PCS설치여부', '설비밀도', '기온X습도',
#        '강수유무'],
#       dtype='object')